In [45]:
# Import Libraries and Dependencies
import pandas as pd
from datetime import datetime

### 1. Combine and Clean the Data
#### Import CSVs

In [46]:
# Read the CSV files into DataFrames.
df = pd.read_csv(r"C:\Users\jakem\athletic_sales_analysis\M5_Starter_Code\Starter_Code\Resources\athletic_sales_2020.csv")
df1 = pd.read_csv(r"C:\Users\jakem\athletic_sales_analysis\M5_Starter_Code\Starter_Code\Resources\athletic_sales_2021.csv")

In [47]:
# Display the 2020 sales DataFrame
df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [48]:
# Display the 2021 sales DataFrame
df1.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [49]:
# Check the 2020 sales data types.
print(df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [50]:
# Check the 2021 sales data types.
print(df1.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [51]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_df = pd.concat([df, df1], ignore_index=True)
display(combined_df)

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
9638,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
9639,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
9640,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
9641,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
9642,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

In [52]:
# Check if any values are null.
combined_df.isnull().values.any()

False

In [53]:
# Check the data type of each column
print(combined_df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [54]:
#change datatype of invoice_date to datetime

combined_df["invoice_date"] = pd.to_datetime(combined_df["invoice_date"])

C:\Users\jakem\AppData\Local\Temp\ipykernel_21712\1427147084.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_df["invoice_date"] = pd.to_datetime(combined_df["invoice_date"])

In [55]:
# Confirm that the "invoice_date" data type has been changed.
print(combined_df["invoice_date"].dtype)

datetime64[ns]

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [56]:
# Show the number products sold for region, state, and city.    
region = combined_df.groupby("region")["product"].count()

# Rename the sum to "Total_Products_Sold".
region = combined_df.groupby("region")["product"].count().rename("Total_Products_Sold")

# Show the top 5 results.
top_5_regions = region.nlargest(5)
print(top_5_regions)

region
West         2445
Northeast    2376
Midwest      1870
South        1728
Southeast    1224
Name: Total_Products_Sold, dtype: int64

#### Using `pivot_table`

In [57]:
#Using `pivot_table`Show the number products sold for region, state, and city.
pivot_table = combined_df.pivot_table(index=['region', 'state', 'city'], values='units_sold', aggfunc='count')

# Rename the "units_sold" column to "Total_Products_Sold"
pivot_table.rename(columns={'units_sold': 'Total_Products_Sold'}, inplace=True)
#
# Print top 5
top_5_results = pivot_table.nlargest(5, 'Total_Products_Sold')
print(top_5_results)

                                      Total_Products_Sold
region    state         city
Northeast Connecticut   Hartford                      216
          Massachusetts Boston                        216
          New Hampshire Manchester                    216
          New York      New York                      216
          Pennsylvania  Philadelphia                  216

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [58]:
total_sales = combined_df.groupby(['region', 'state', 'city'])['total_sales'].sum().reset_index()
top_5_totals = total_sales.nlargest(5, 'total_sales')
print(top_5_totals)

       region           state           city  total_sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

#### Using `pivot_table`

In [59]:
# Show the total sales for the products sold for each region, state, and city.

total_sales_pt = combined_df.pivot_table(values='total_sales', index=['region', 'state', 'city'], aggfunc='sum').reset_index()

# Optional: Rename the "total_sales" column to "Total Sales"
total_sales_pt.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
top_5_totals_pt = total_sales_pt.nlargest(5, 'Total Sales') 
print(top_5_totals_pt)

       region           state           city  Total Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [60]:
# Show the total sales for the products sold for each retailer, region, state, and city.
top_retailers = combined_df.groupby(['retailer', 'region', 'state', 'city'])['total_sales'].sum().reset_index()

# Rename the "total_sales" column to "Total Sales"
top_retailers.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results by 'Total Sales'
top_5_retailers = top_retailers.nlargest(5, 'Total Sales')

print(top_5_retailers)

        retailer     region           state           city  Total Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

#### Using `pivot_table`

In [61]:
# Show the total sales for the products sold for each region, state, and city.

top_retailers_pt = combined_df.pivot_table(values='total_sales', index=['region', 'state', 'city'], aggfunc='sum').reset_index()


# Optional: Rename the "total_sales" column to "Total Sales"
top_retailers_pt.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
top_5_retailers = top_retailers_pt.nlargest(5, 'Total Sales')
print(top_5_retailers)

       region           state           city  Total Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [62]:
# Filter the sales data to get the women's athletic footwear sales data.
women_athletic_footwear = combined_df[combined_df['product'] == "Women's Athletic Footwear"]
women_athletic_footwear.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
21,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,36,281,10116,3742.92,Outlet
22,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,41,247,10127,4658.42,Online
23,Foot Locker,1185732,2020-01-04,Northeast,New York,New York,Women's Athletic Footwear,45,850,382500,133875.00,In-store
26,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,45,300,135000,47250.00,Outlet
27,West Gear,1128299,2020-01-05,Northeast,Pennsylvania,Philadelphia,Women's Athletic Footwear,34,90,3060,1254.60,Outlet

#### Using `groupby`

In [63]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
women_athletic_footwear = combined_df[combined_df['product'] == "Women's Athletic Footwear"]
total_sold = women_athletic_footwear.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].sum().reset_index()
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
total_sold.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)
# Display the top 5 locations with the highest sales
top_sales_locations = total_sold.nlargest(5, 'Womens_Footwear_Units_Sold')
print(top_sales_locations)

          retailer     region           state           city  \
101      West Gear       West      California  San Francisco
22     Foot Locker  Northeast        New York       New York
49          Kohl's       West      California    Los Angeles
33     Foot Locker  Southeast  South Carolina     Charleston
68   Sports Direct      South           Texas         Dallas

     Womens_Footwear_Units_Sold
101                       12107
22                        10996
49                        10826
33                         8814
68                         8790

#### Using `pivot_table`

In [64]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
pivot_table = women_athletic_footwear.pivot_table(values='units_sold', index=['retailer', 'region', 'state', 'city'], aggfunc='sum')

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
pivot_table.columns = ['Womens_Footwear_Units_Sold']

# Show the top 5 results
top_5_results = pivot_table.nlargest(5, 'Womens_Footwear_Units_Sold')
print(top_5_results)

                                                      Womens_Footwear_Units_Sold
retailer      region    state          city
West Gear     West      California     San Francisco                       12107
Foot Locker   Northeast New York       New York                            10996
Kohl's        West      California     Los Angeles                         10826
Foot Locker   Southeast South Carolina Charleston                           8814
Sports Direct South     Texas          Dallas                               8790

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [65]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pivot_table = df.pivot_table(values='total_sales', index='invoice_date', aggfunc='sum')

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_table.columns = ['Total Sales']

# Show the table
print(pivot_table)

              Total Sales
invoice_date
1/1/20             845141
1/10/20            200469
1/11/20            129556
1/12/20            104982
1/13/20            189096
...                   ...
9/5/20             402432
9/6/20             399393
9/7/20             882296
9/8/20             726106
9/9/20             814562

[358 rows x 1 columns]

In [66]:
pivot_table.index = pd.to_datetime(pivot_table.index)
daily_sales = pivot_table.resample('D').sum()
daily_sales.head()

C:\Users\jakem\AppData\Local\Temp\ipykernel_21712\2638534997.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  pivot_table.index = pd.to_datetime(pivot_table.index)

              Total Sales
invoice_date
2020-01-01         845141
2020-01-02         689410
2020-01-03         632573
2020-01-04         615080
2020-01-05         707829

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [67]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_sales = pivot_table.resample('W').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
sorted_weekly_sales = weekly_sales.sort_values(by='Total Sales', ascending=False)
sorted_weekly_sales.head(5)

              Total Sales
invoice_date
2020-04-26       13165823
2020-05-03        7349542
2020-03-15        6719747
2020-09-13        6509653
2020-02-09        6234951